module BaggageListsHelper
  def baggage_list_items
    baggage_list_items = {
      "相关证件" => ["身份证", "机票，航空会员卡", "2寸照片2张", 
                     "身份证复印件", "人民币现金", "机场贵宾室会员证", 
                     "亲友电话，通讯录", "保险卡"],
      "旅行随身" => ["行程表、地图", "手机、充电器", "国际电话卡", 
                     "电池、充电器", "变压器、转换插座", "旅游书籍", 
                     "纸、笔", "CD、MP3", "笔记本电脑"], 
      "换洗衣物" => ["睡衣", "换洗内衣裤", "休闲上衣、长短裤或裙", 
                      "御寒外套", "拖鞋、凉鞋、运动鞋", "袜子", "游泳衣物"], 
      "护理用品" => ["遮阳帽、太阳眼镜", "漱洗工具、刮胡刀", "生理用品", 
                     "防晒油、护唇膏", "化妆品", "隐形眼镜用品"], 
      "随行工具" => ["行李箱锁、钥匙", "雨伞、雨衣、鞋套", "备用眼镜", 
                     "指甲刀、瑞士刀", "闹钟、计算器", "吹风机", 
                     "塑胶袋、洗衣袋", "保温（冷）袋", "针线包"], 
      "摄影器材" => ["胶卷", "照相机", "摄像机", "望远镜", "三脚架"], 
      "户外装备" => ["电汤勺", "钢杯、铁碗", "个人餐具（筷，勺）", 
                     "旅行充气枕","登山杖", "随身袋、腰包、背包", 
                     "行李绑带", "塑胶绳", "睡袋", "帐篷", "防潮垫", 
                     "手电", "指南针"], 
      "休闲食品" => ["保养品", "糖果", "饼干", "零食"], 
      "常备药品" => ["肠胃药", "止泻药", "感冒药", "止痛药", "晕车药", 
                     "眼药水", "创可贴", "皮肤用药", "口腔药膏", "防蚊液",
                     "降血压药", "心脏用药", "医生处方", "健康证明"]
    }
  end

  def is_checked?(baggage_list, item)
    return false if baggage_list.checked_items == nil
    !!baggage_list.checked_items.index(item)
  end
end
